pascal-4.0/tutorialsOld/surfaceTracking/interTrackFoam/swash2Daxial/constant/polyMesh/blockMeshDict
//
FoamFile
{
  version 2.0;
  format  ascii;
  class   dictionary;
  object  blockMeshDict;
}

convertToMeters 0.001;

vertices
(
  (0.000000 0.000000 0.000000) 		// vertex 0
  (42.459549 -1.853824 0.000000) 		// vertex 1
  (84.919099 -3.707648 0.000000) 		// vertex 2
  (0.000000 0.000000 116.500000) 		// vertex 3
  (42.459549 -1.853824 116.500000) 		// vertex 4
  (84.919099 -3.707648 116.500000) 		// vertex 5
  (0.000000 0.000000 233.000000) 		// vertex 6
  (42.459549 -1.853824 233.000000) 		// vertex 7
  (84.919099 -3.707648 233.000000) 		// vertex 8
  (42.459549 1.853824 0.000000) 		// vertex 9
  (84.919099 3.707648 0.000000) 		// vertex 10
  (42.459549 1.853824 116.500000) 		// vertex 11
  (84.919099 3.707648 116.500000) 		// vertex 12
  (42.459549 1.853824 233.000000) 		// vertex 13
  (84.919099 3.707648 233.000000) 		// vertex 14
  (0.000000 0.000000 235.000000) 		// vertex 15
  (42.459549 -1.853824 235.000000) 		// vertex 16
  (84.919099 -3.707648 235.000000) 		// vertex 17
  (42.459549 1.853824 235.000000) 		// vertex 18
  (84.919099 3.707648 235.000000) 		// vertex 19
);

blocks
(
  hex (0 1 9 0 3 4 11 3)      liCond (22 1 59) simpleGrading (1 1 1)
  hex (1 2 10 9 4 5 12 11)    liCond (22 1 59) simpleGrading (1 1 1)
  hex (3 4 11 3 6 7 13 6)     liCond (22 1 59) simpleGrading (1 1 1)
  hex (4 5 12 11 7 8 14 13)   liCond (22 1 59) simpleGrading (1 1 1)
  hex (6 7 13 6 15 16 18 15)  liCond (22 1 1 ) simpleGrading (1 1 1)
  hex (7 8 14 13 16 17 19 18) liCond (22 1 1 ) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  freeSurface
  {
    type patch;
    faces
    (
      (15 16 18 15)
      (16 17 19 18)
    );
  }
  side
  {
    type wall;
    faces
    (
      ( 8 14 19 17)
      ( 2 10 12  5)
      ( 5 12 14  8)
    );
  }
  bottom
  {
    type wall;
    faces
    (
      ( 0  1  9  0)
      ( 1  2 10  9)
    );
  }
  front
  {
    type wedge;
    faces
    (
      ( 0  1  4  3)
      ( 1  2  5  4)
      ( 3  4  7  6)
      ( 4  5  8  7)
      ( 6  7 16 15)
      ( 7  8 17 16)
    );
  }
  back
  {
    type wedge;
    faces
    (
      ( 0  3 11  9)
      ( 9 11 12 10)
      ( 3  6 13 11)
      (11 13 14 12)
      ( 6 13 18 15)
      (13 14 19 18)
    );
  }
  axis
  {
    type empty;
    faces
    (
      ( 0  3  3  0)
      ( 3  6  6  3)
    );
  }
);

mergePatchPairs
(
);
