pascal-4.0/tutorialsOld/surfaceTracking/interTrackFoam/swash2Daxial/constant/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// ************************************************************************** //

polyMeshPatches  1( freeSurface );

boundary
{
    side
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  side;
    }
    front
    {
        type                wedge;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  front;
    }
    back
    {
        type                wedge;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  back;
    }
    axis
    {
        type                empty;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  axis;
    }
}

// ************************************************************************** //
